cmsis-svd/cmsis-svd/data/Atmel/ATSAM3A8C.svd
        <register>
          <name>SCR</name>
          <description>General Status Clear Register</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDTIC</name>
              <description>ID Transition Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSTIC</name>
              <description>VBus Transition Interrupt Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRPIC</name>
              <description>SRP Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBERRIC</name>
              <description>VBus Error Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BCERRIC</name>
              <description>B-Connection Error Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROLEEXIC</name>
              <description>Role Exchange Interrupt Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HNPERRIC</name>
              <description>HNP Error Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STOIC</name>
              <description>Suspend Time-Out Interrupt Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSRQC</name>
              <description>VBus Request Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFR</name>
          <description>General Status Set Register</description>
          <addressOffset>0x0000080C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDTIS</name>
              <description>ID Transition Interrupt Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSTIS</name>
              <description>VBus Transition Interrupt Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRPIS</name>
              <description>SRP Interrupt Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBERRIS</name>
              <description>VBus Error Interrupt Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BCERRIS</name>
              <description>B-Connection Error Interrupt Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROLEEXIS</name>
              <description>Role Exchange Interrupt Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HNPERRIS</name>
              <description>HNP Error Interrupt Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STOIS</name>
              <description>Suspend Time-Out Interrupt Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSRQS</name>
              <description>VBus Request Set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM</name>
          <description>General Finite State Machine Register</description>
          <addressOffset>0x0000082C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000009</resetValue>
          <fields>
            <field>
              <name>DRDSTATE</name>
              <description>Dual Role Device State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A_IDLESTATE</name>
                  <description>This is the start state for A-devices (when the ID pin is 0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_VRISE</name>
                  <description>In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_BCON</name>
                  <description>In this state, the A-device waits for the B-device to signal a connection.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_HOST</name>
                  <description>In this state, the A-device that operates in Host mode is operational.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_SUSPEND</name>
                  <description>The A-device operating as a host is in the suspend mode.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_PERIPHERAL</name>
                  <description>The A-device operates as a peripheral.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_VFALL</name>
                  <description>In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V).</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_VBUS_ERR</name>
                  <description>In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_DISCHARGE</name>
                  <description>In this state, the A-device waits for the data USB line to discharge (100 us).</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_IDLE</name>
                  <description>This is the start state for B-device (when the ID pin is 1).</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_PERIPHERAL</name>
                  <description>In this state, the B-device acts as the peripheral.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_WAIT_BEGIN_HNP</name>
                  <description>In this state, the B-device is in suspend mode and waits until 3 ms before initiating the HNP protocol if requested.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_WAIT_DISCHARGE</name>
                  <description>In this state, the B-device waits for the data USB line to discharge (100 us) before becoming Host.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_WAIT_ACON</name>
                  <description>In this state, the B-device waits for the A-device to signal a connect before becoming B-Host.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_HOST</name>
                  <description>In this state, the B-device acts as the Host.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_SRP_INIT</name>
                  <description>In this state, the B-device attempts to start a session using the SRP protocol.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
